import os
import sys
import time
import textwrap
from pathlib import Path
import json
from platformdirs import user_data_dir

def get_save_path():
    app_name="Cat_One_Day"
    data_dir=Path(user_data_dir(app_name, "Velyka"))

    data_dir.mkdir(parents=True, exist_ok=True)
    return data_dir / "records.json"

def draw_box(lines):
    max_width = 70
    processed_lines = []
    for line in lines:
        if line == "---":
            processed_lines.append("---")
        elif not line:
            processed_lines.append("")
        else:
            processed_lines.extend(textwrap.wrap(line, width=max_width))
    content_lines = [l for l in processed_lines if l != "---"]
    if not content_lines:
        width = max_width
    else:
        width = max([len(line) for line in content_lines])
    print(f"╔{'═' * (width + 2)}╗")
    for line in processed_lines:
        if line == "---":
            print(f"╠{'═' * (width + 2)}╣")
        else:
            print(f"║ {line.ljust(width)} ║")
    print(f"╚{'═' * (width + 2)}╝")

def save_result(player_name, score, total_time):
    new_result={
        "player_name": player_name,
        "score": score,
        "total_time": total_time
    }
    filename=get_save_path()
    if not filename.exists():
        with filename.open("w", encoding="utf-8") as f:
            json.dump([], f)
    try:
        with filename.open("r", encoding="utf-8") as f:
            all_results=json.load(f)
    except (json.decoder.JSONDecodeError, ValueError):
        all_results=[]
        print("[!] Ошибка: файл рекордов поврежден. Начинаем с чистого листа.")
    all_results.append(new_result)
    with filename.open("w", encoding="utf-8") as f:
        json.dump(all_results, f, indent=4, ensure_ascii=False)
    print("Результаты записаны в таблицу!")
    return

def draw_hud(current_lives, current_score):
    stats=f"Жизни{"❤ " * current_lives} | Очки: {current_score}"
    print(stats.rjust(75))

def cat_anim():
    time.sleep(1)
    for i in range(5):
        os.system('cls' if os.name == 'nt' else 'clear')
        print(r"""
          /\_/\
         ( o.o )
          > ^ <
         /     \
        |       |\__
         \_____/  `*)
        """)
        time.sleep(3)
        os.system('cls' if os.name == 'nt' else 'clear')
        print(r"""
          /\_/\
         ( -.- )
          > ^ <
         /     \
        |       |\__
         \_____/  `*)
        """)
        time.sleep(0.2)
    os.system('cls' if os.name == 'nt' else 'clear')

def start_game():
    while True:
        name=input("Дай имя котику (До 10 символов!): ").capitalize().strip()
        os.system('cls' if os.name == 'nt' else 'clear')
        if not name:
            print("Имя не может быть пустым!")
        elif len(name) >10:
            print("Имя слишком длинное:(\nМаксимум 10 символов!")
        elif not name.isalpha():
            print("Надо буквы вводить, а не цифры")
        else:
            player_name=name
            break
    lives=3
    score=0
    start_time=time.time()
    #Глава 1
    try:
        draw_hud(lives, score)
        print(r"""
                   |\      _,,,---,,_
            ZZZzz /,`.-'`'    -.  ;-;;,_
                 |,4-  ) )-,_. ,\ (  `'-'
                '---''(_/--'  `-'\_)
        """)
        draw_box([f"{player_name} открывает один глаз. Солнечный луч медленно ползет по ковру, дразня \nпылинки. В квартире тихо, слышно только сопение кожаных мешков под одеялом. \n{player_name} потягивается, чувствуя каждую мышцу. Его желудок урчит так громко, что этот \nзвук мог бы разбудить соседей. Голод — не тетка, голод — это {player_name}. Пора действовать.",
                    "---",
                    "1. Прыгнуть хозяину на живот.",
                    "2. Пойти на кухню и орать.",
                    "3. Подрать диван."
                    ])
        ans=int(input("Ваш выбор: "))
        os.system('cls' if os.name == 'nt' else 'clear')
        match ans:
            case 1:
                lives-=1
                #input(f"-1 жизнь.\n{player_name} делает «бомбочку» на спящего человека. Хозяин с перепугу рефлекторно откидывает кота. \nПолет в стену заканчивается больно.")
                draw_box(["-1 жизнь.",
                          "---",
                         f"{player_name} делает «бомбочку» на спящего человека. Хозяин с перепугу рефлекторно откидывает кота. \nПолет в стену заканчивается больно."])
                input()
            case 2:
                score+=20
                draw_box(["+20 очков.",
                          "---",
                          f"{player_name} славно поточил когти. Диван испорчен, а {player_name} доволен."])
                input()
            case 3:
                score+=10
                draw_box(["+10 очков.",
                          "---",
                          f"{player_name} идет на кухню и выдает требовательное «МЯУ!». Сонный хозяин, чтобы заткнуть этот сирену, насыпает полную миску корма."])
                input()
            case _:
                os.system('cls' if os.name == 'nt' else 'clear')
                print("Выбор у тебя не особо велик...")
    except ValueError:
        os.system('cls' if os.name == 'nt' else 'clear')
        print("В чем дело? Надо цифру ввести, а не букву")
    os.system('cls' if os.name == 'nt' else 'clear')
    #Глава 2
    try:
        draw_hud(lives, score)
        draw_box([f"Квартира пуста. Кожаные мешки ушли добывать ресурсы, оставив {player_name} полноправным властелином этих земель. \nНа подоконнике красуется кактус. Тишину нарушает лишь наглое жужжание. На оконном стекле сидит ОНА. \nЖирная, черная муха. Она потирает лапки, словно насмехаясь над хищником. \n{player_name} чувствует, как дергается его хвост. Инстинкт убийцы проснулся.",
                    "---",
                    "1. Устроить засаду на подоконнике.",
                    "2. Просто поспать в луче солнца.",
                    "3. Съесть кактус."
                    ])
        ans=int(input("Ваш выбор: "))
        os.system('cls' if os.name == 'nt' else 'clear')
        match ans:
            case 1:
                score+=20
                draw_box(["+20 очков.",
                          "---",
                          f"Резкий прыжок! ХВАТЬ! Муха оказывается в зубах. {player_name} хрустит добычей."])
                input()
            case 2:
                score+=10
                draw_box(["+10 очков.",
                          "---",
                          f"{player_name} игнорирует муху и растекается лужицей на солнечном пятне. Энергия восстанавливается."])
                input()
            case 3:
                lives-=1
                draw_box(["-1 жизнь.",
                          "---",
                          f"{player_name} кусает «зеленую муху». Ошибка! Рот полон иголок. Он бегает и плюется."])
                input()
            case _:
                os.system('cls' if os.name == 'nt' else 'clear')
                print("Выбор у тебя не особо велик...")
    except ValueError:
        os.system('cls' if os.name == 'nt' else 'clear')
        print("В чем дело? Надо цифру ввести, а не букву")
    os.system('cls' if os.name == 'nt' else 'clear')
    #Глава 3
    try:
        draw_hud(lives, score)
        print(r"""
                   .---.
                 _/_____\_
                (_________)  <-- РОБОТ-УБИЙЦА
                 |_______|
               __|_______|__
              /             \
             |               |
             |  ВЖЖЖУУУХ!!!  |
             |_______________|
        """)
        draw_box([f"Внезапную тишину разрывает адский рев. Из угла выезжает ОН — Робот-пылесос. \nКруглый диск дьявола, пожиратель носков и враг всего живого. {player_name} шипит, \nвыгибая спину дугой. Чудовище медленно, но верно ползет в сторону любимой \nлежанки кота. Это война.",
                    "---",
                    "1. Атаковать кнопку выключения.",
                    "2. Занять высоту на холодильнике.",
                    "3. Понюхать вращающуюся щетку."
                    ])
        ans=int(input("Ваш выбор: "))
        os.system('cls' if os.name == 'nt' else 'clear')
        match ans:
            case 1:
                score+=10
                draw_box(["+10 очков.",
                          "---",
                          f"{player_name} занимает стратегическую высоту. Робот ползает внизу, бессильный достать царя горы."])
                input()
            case 2:
                score+=20
                draw_box(["+20 очков.",
                          "---",
                          f"Серия ударов лапой! БИП! Огни гаснут, монстр затих. {player_name} победил восстание машин."])
                input()
            case 3:
                lives-=1
                draw_box(["-1 жизнь.",
                          "---",
                          f"{player_name} сует нос под бампер. ВЖУХ! Усы намотало на валик! Пришлось вырываться силой, оставив клок шерсти."])
                input()
            case _:
                os.system('cls' if os.name == 'nt' else 'clear')
                print("Выбор у тебя не особо велик...")
    except ValueError:
        os.system('cls' if os.name == 'nt' else 'clear')
        print("В чем дело? Надо цифру ввести, а не букву")
    os.system('cls' if os.name == 'nt' else 'clear')
    if lives<=0:
        end_time=time.time()
        total_time=end_time-start_time
        print(f"Ты умер... \nТвои очки:{score}\nВремя прохождения:{round(total_time)}\n")
        save_result(player_name, score, total_time)
        input("Нажми любую клавишу чтобы вернуться в меню...")
        os.system('cls' if os.name == 'nt' else 'clear')
        return
    #Глава 4
    try:
        draw_hud(lives, score)
        draw_box([f"Хозяева вернулись. На кухне пахнет жареной курицей так сильно, что у {player_name} \nкружится голова. Хозяин отвернулся, нарезая салат. На краю стола стоит тарелка с \nостывающими кусочками филе. Этот запах сводит с ума.",
                    "---",
                    "1. Прыгнуть на плиту.",
                    "2. Сделать милые глазки.",
                    "3. Украсть курицу."
                    ])
        ans=int(input("Ваш выбор: "))
        os.system('cls' if os.name == 'nt' else 'clear')
        match ans:
            case 1:
                lives-=1
                draw_box(["-1 жизнь.",
                          "---",
                          f"{player_name} промахивается мимо стола и приземляется на горячую конфорку. ПШШШ! Запах паленой шерсти и дикий визг."])
                input()
            case 2:
                score+=10
                draw_box(["+10 очков.",
                          "---",
                          f"{player_name} трется об ноги и мурчит. Хозяин тает: «Ну на, не плачь». Легальный кусочек получен."])
                input()
            case 3:
                score+=20
                draw_box(["+20 очков.",
                          "---",
                          f"Ловкость лап и никакого мошенничества. Пока хозяин отвернулся, кусок филе исчез под диван. Вкусно!"])
                input()
            case _:
                os.system('cls' if os.name == 'nt' else 'clear')
                print("Выбор у тебя не особо велик...")
    except ValueError:
        os.system('cls' if os.name == 'nt' else 'clear')
        print("В чем дело? Надо цифру ввести, а не букву")
    os.system('cls' if os.name == 'nt' else 'clear')
    if lives<=0:
        end_time = time.time()
        total_time = end_time - start_time
        print(f"Ты умер... \nТвои очки:{score}\nВремя прохождения:{round(total_time)}\n")
        save_result(player_name, score, total_time)
        input("Нажми любую клавишу чтобы вернуться в меню...")
        os.system('cls' if os.name == 'nt' else 'clear')
        return
    #Глава 5
    try:
        draw_hud(lives, score)
        draw_box([f"Глубокая ночь. Луна светит в окно. Все нормальные существ спят, но у {player_name} \nрасширяются зрачки. Древние демоны скорости вселяются в его пушистое тело. \nЭнергия переполняет лапы. Ему нужно бежать. Быстро. Везде. СЕЙЧАС.",
                    "---",
                    "1. Уронить вазу.",
                    "2. Влететь в дверь.",
                    "3. Паркур по стенам."
                    ])
        ans=int(input("Ваш выбор: "))
        os.system('cls' if os.name == 'nt' else 'clear')
        match ans:
            case 1:
                score+=20
                draw_box(["+20 очков.",
                          "---",
                          f"Лапа толкает фарфор. БДЫЩ!!! Осколки везде. Хозяин орет, но {player_name} доволен хаосом."])
                input()
            case 2:
                lives-=1
                draw_box(["-1 жизнь.",
                          "---",
                          "Разгон до 100 км/ч... и удар головой о закрытую стеклянную дверь. БОНЬК! Птички в глазах."])
                input()
            case 3:
                score+=10
                draw_box(["+10 очков.",
                          "---",
                          f"{player_name} бегает по стенам коридора, не касаясь пола. Гравитация для слабаков."])
                input()
            case _:
                os.system('cls' if os.name == 'nt' else 'clear')
                print("Выбор у тебя не особо велик...")
    except ValueError:
        os.system('cls' if os.name == 'nt' else 'clear')
        print("В чем дело? Надо цифру ввести, а не букву")
    os.system('cls' if os.name == 'nt' else 'clear')
    if lives<=0:
        end_time = time.time()
        total_time = end_time - start_time
        print(f"Ты умер... \nТвои очки:{score}\nВремя прохождения:{round(total_time)}\n")
        save_result(player_name, score, total_time)
        input("Нажми любую клавишу чтобы вернуться в меню...")
        os.system('cls' if os.name == 'nt' else 'clear')
        return
    elif score<=100:
        end_time = time.time()
        total_time = end_time - start_time
        print(r"""
            ╔════════════════╗
            ║ ТЫ ПОБЕДИЛ!    ║
            ║ КОРОЛЬ КВАРТИРЫ║
            ╚════════════════╝
                |\__/| ||
                (•ㅅ-) ||
                / 　 づ        
        """)
        print(f"Твои очки: {score} \nТвое время:{round(total_time)}")
        if score==100:
            print(f"Ого! котик {player_name} набрал максимальное кол-во очков!\nПоздравляем!")
        save_result(player_name, score, total_time)
        input("Нажмите любую клавишу для возврата в меню...")
        os.system('cls' if os.name == 'nt' else 'clear')
    return

def list_score():
    os.system('cls' if os.name == 'nt' else 'clear')
    filename=get_save_path()
    if not filename.exists():
        with filename.open("w", encoding="utf-8") as f:
            json.dump([],f)
    try:
        with filename.open("r", encoding="utf-8") as f:
            all_records = json.load(f)
    except (json.decoder.JSONDecodeError, ValueError):
        all_records = []
        print("[!] Ошибка: файл рекордов поврежден. Начинаем с чистого листа.")
    if not all_records:
        print("╔══════════════════════════╗")
        print("║    Таблица пустая :(     ║")
        print("║ Попробуй сыграть в игру! ║")
        print("╚══════════════════════════╝")
        input("Нажмите любую клавишу для продолжения...")
        os.system('cls' if os.name == 'nt' else 'clear')
        return
    all_records.sort(key=lambda x: (x["score"], -x['total_time']), reverse=True)
    print("╔═════╦═══════════════════════╦══════╦═════════╗")
    print("║  №  ║       Имя котика      ║ Очки ║  Время  ║")
    print("╠═════╬═══════════════════════╬══════╬═════════╣")
    for index, item in enumerate(all_records, start=1):
        column_w=21
        name=item['player_name']
        time=f"{round(item['total_time'])} c."
        if item['score']==100:
            name=f"👑 {name}"
            column_w-=1
        score=str(item['score'])
        print(f"║ {str(index).ljust(3)} ║ {name.ljust(column_w)} ║ {score.ljust(4)} ║ {time.ljust(7)} ║")
    print("╚═════╩═══════════════════════╩══════╩═════════╝")
    input("Нажмите любую клавишу для продолжения...")
    os.system('cls' if os.name == 'nt' else 'clear')
    return

def exit_game():
    os.system('cls' if os.name == 'nt' else 'clear')
    while True:
        ans_1=input("Вы уверены, что хотите выйти из игры?(Y/N): ")
        os.system('cls' if os.name == 'nt' else 'clear')
        match ans_1:
            case "Y" | "y":
                print("До встречи!")
                sys.exit()
            case "N" | "n":
                return
            case _:
                print("Тебе же сказали y/n. А ты что хуйню пишешь?")

def main():
    os.system('cls' if os.name == 'nt' else 'clear')
    while True:
        try:
            draw_box([
            "Кошачий переполох♥",
            "---",
            "1. Играть!",
            "2. Таблица рекордов.",
            "3. Котик?!",
            "4. Выход :("
            ])
            ans=int(input("Выберите цифру меню: "))
            os.system('cls' if os.name == 'nt' else 'clear')
            match ans:
                case 1:
                    start_game()
                case 2:
                    list_score()
                case 3:
                    cat_anim()
                case 4:
                    exit_game()
                case _:
                    print("А ты что, видишь тут больше 4??")
        except ValueError:
            os.system('cls' if os.name == 'nt' else 'clear')
            print("Ты ебанат?) Попросили же блять цифру...")

if __name__ == "__main__":
    main()